package com.company.lesson1;

public class Main {
    public static void main(String[] args) {
        /*Объявите переменные name1, name2, name3 типа String. Сразу же в строке объявления присвойте им какие-нибудь значения. Значениями могут быть любые строки.*/
        /*Напиши программу, которая выводит на экран надпись: «Когда я вырасту, то хочу быть паровым экскаватором!» 10 раз.*/
        String name1 = "Когда я вырасту, то хочу быть паровым экскаватором", name2 = "a", name3 = "b";
        for (int i = 0; i < 10; i++) {
            System.out.println(name1);
        }
        /*Раскоментируйте часть кода, чтобы на экран вывелось сообщение "Happy New Year"*/
        System.out.println("Happy new year!");
        /*Внесите изменения в программу, чтобы переменная s была равна 5, t была равна 6, а x равна 7. Программа должна компилироваться.*/
        int s = 5, t = 6, x = 7;
        /*Задание: вывести на экран текст
        Меня зовут Амиго.

        Я согласен на зарплату $10/месяц в первый год.
        Я согласен на зарплату $20/месяц во второй год.
        Я согласен на зарплату $30/месяц в третий год.
        Я согласен на зарплату $40/месяц в четвертый год.
        Я согласен на зарплату $50/месяц в пятый год.

        Спасибо за щедрость, друг Риша!*/
        String a1 = "Меня зовут Амиго";
        String a2 = "Я согласен на зарплату $10/месяц в первый год";
        String a3 = "Я согласен на зарплату $20/месяц во второй год";
        String a4 = "Я согласен на зарплату $30/месяц в третий год";
        String a5 = "Я согласен на зарплату $40/месяц в четвертый год";
        String a6 = "Я согласен на зарплату $50/месяц в пятый год\"";
        String a7 = "Спасибо за щедрость, друг Риша";
        System.out.println(a1);
        System.out.println(a2);
        System.out.println(a3);
        System.out.println(a4);
        System.out.println(a5);
        System.out.println(a6);
        System.out.println(a7);
        /*Новое задание: написать программу, которая выводит на экран строки:
        Меня зовут Амиго.

        Я согласен на зарплату $800/месяц в первый год.
        Я согласен на зарплату $1500/месяц во второй год.
        Я согласен на зарплату $2200/месяц в третий год.
        Я согласен на зарплату $2700/месяц в четвертый год.
        Я согласен на зарплату $3200/месяц в пятый год.

        Поцелуй мой блестящий металлический зад
         */
        String b1 = "Меня зовут Амиго";
        String b2 = "Я согласен на зарплату $800/месяц в первый год";
        String b3 = "Я согласен на зарплату $1500/месяц во второй год";
        String b4 = "Я согласен на зарплату $2200/месяц в третий год";
        String b5 = "Я согласен на зарплату $2700/месяц в четвертый год";
        String b6 = "Я согласен на зарплату $3200/месяц в пятый год\"";
        String b7 = "Поцелуй мой металлический зад!";
        System.out.println(b1);
        System.out.println(b2);
        System.out.println(b3);
        System.out.println(b4);
        System.out.println(b5);
        System.out.println(b6);
        System.out.println(b7);
        /*Напиши программу, которая выводит на экран надпись: «Слава Роботам! Убить всех человеков!» 16 раз.*/
        for (int i = 0; i < 16; i++) {
            System.out.println("Слава Роботам! Убить всех человеков!");
        }




    }
}
